amr/0/p
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    inlet
    {
        type            zeroGradient;
    }

    outlet
    {
        type            fixedValue;
        value           uniform 0;
    }

    wall1
    {
        type            zeroGradient;
        
    }
     wall2
    {
        type           zeroGradient;
        
    }
     wall3
    {
        type            zeroGradient;
        
    }
     wall4
    {
        type            zeroGradient;
       
    }
     wall5
    {
        type           zeroGradient;
        
    }
    
    frontwall
    {
        type            symmetry;
    }
    backwall
    {
        type            symmetry;
    }
}

// ************************************************************************* //
